src/Documents/УстановкаСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УстановкаСкидок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Скидки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Скидки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураНоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/УстановкаСкидок/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Объект.Согласовано Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкиНоменклатураНоменклатурнаяГруппаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Скидки.ТекущиеДанные;
	ПриИзмененииНоменклатуры(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)

	Если ЗначениеЗаполнено(ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа) Тогда
		Скидка = ЦеныВызовСервера.СкидкаНаДату(ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа, ТекущаяДата());
		
		Если Не ЗначениеЗаполнено(Скидка) И ТипЗнч(ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
			
			НоменклатурнаяГруппа = ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа;
			
			Если ЗначениеЗаполнено(НоменклатурнаяГруппа) Тогда
				Скидка = ЦеныВызовСервера.СкидкаНаДату(НоменклатурнаяГруппа, ТекущаяДата());
			КонецЕсли;
			
		КонецЕсли;
		
		ИзмененнаяСтрока.Скидка = Скидка;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьНоменклатурнуюГруппу(Номенклатура)
	
	Возврат Номенклатура.НоменклатурнаяГруппа;
	
КонецФункции
